#1. Вибрати весь особовий склад із зазначенням підрозділу та посади
SELECT 
    ОС.ID_особи, ОС.Ім_я, ОС.Прізвище, ОС.Звання, Підр.Назва AS Підрозділ, Пос.Назва AS Посада
FROM Особовий_склад ОС
JOIN Підрозділи Підр ON ОС.ID_підрозділу = Підр.ID_підрозділу
JOIN Посади Пос ON ОС.ID_посади = Пос.ID_посади;

#2. Знайти всіх військових, які мають звання "Капітан"
SELECT 
    Ім_я, Прізвище, Звання 
FROM Особовий_склад 
WHERE Звання = 'Капітан';

#3. Підрахувати кількість осіб у кожному підрозділі
SELECT 
    Підр.Назва AS Підрозділ, COUNT(ОС.ID_особи) AS Кількість_осіб
FROM Особовий_склад ОС
JOIN Підрозділи Підр ON ОС.ID_підрозділу = Підр.ID_підрозділу
GROUP BY Підр.Назва;

#4. Отримати список посад із зазначенням кількості людей на кожній посаді
SELECT 
    Пос.Назва AS Посада, COUNT(ОС.ID_особи) AS Кількість_осіб
FROM Посади Пос
LEFT JOIN Особовий_склад ОС ON Пос.ID_посади = ОС.ID_посади
GROUP BY Пос.Назва;
#5. Знайти наймолодшого військового
SELECT 
    Ім_я, Прізвище, Дата_народження 
FROM Особовий_склад 
ORDER BY Дата_народження DESC
LIMIT 1;

#6. Знайти всі підрозділи, у яких є військові зі званням "Сержант"
SELECT DISTINCT 
    Підр.Назва AS Підрозділ
FROM Особовий_склад ОС
JOIN Підрозділи Підр ON ОС.ID_підрозділу = Підр.ID_підрозділу
WHERE ОС.Звання = 'Сержант';

#7. Знайти кількість осіб у кожному званні
SELECT 
    Звання, COUNT(*) AS Кількість_осіб
FROM Особовий_склад
GROUP BY Звання;

#8. Отримати інформацію про всіх військових у підрозділі "1-а бригада"
SELECT 
     ОС.Ім_я, ОС.Прізвище, ОС.Звання, Пос.Назва AS Посада
FROM Особовий_склад ОС
JOIN Підрозділи Підр ON ОС.ID_підрозділу = Підр.ID_підрозділу
JOIN Посади Пос ON ОС.ID_посади = Пос.ID_посади
WHERE Підр.Назва = '1-а бригада';

#9. Знайти всіх військових, які народилися після 1990 року
SELECT
    Ім_я, Прізвище, Дата_народження
    FROM Особовий_склад
    WHERE Дата_народження > '1990-01-01';

#10. Знайти середній вік військових у кожному підрозділі
SELECT 
    Підр.Назва AS Підрозділ, 
    AVG(EXTRACT(YEAR FROM AGE(ОС.Дата_народження))) AS Середній_вік
FROM Особовий_склад ОС
JOIN Підрозділи Підр ON ОС.ID_підрозділу = Підр.ID_підрозділу
GROUP BY Підр.Назва;
